const initialState = {
    developers: [
        { imageSrc: 'https://avatars.githubusercontent.com/u/50217581?v=4', githubSrc: 'https://github.com/RBELS' },
        { imageSrc: 'https://m.media-amazon.com/images/I/41R7eDvFFZL._AC_SY580_.jpg', githubSrc: 'https://github.com/Nikstanov' },
        { imageSrc: 'https://i1.sndcdn.com/avatars-5YhOoeqkl8R1QTtE-VPEy0Q-t500x500.jpg', githubSrc: 'https://github.com/IntensioT' }
    ],
    celebrities: [
        {
            id: 0,
            name: 'Міхаіл Рыгоравіч Баразна',
            photo: 'https://upload.wikimedia.org/wikipedia/commons/c/c4/Mikhail_Borozna.jpg',
            text: [
                'Нарадзіўся ў 1962 г. в. Ліхінічы. Акадэмік Беларускай Акадэміі выяўленчага мастацтва. Закончыў Круглянскую сярэднюю школу, Мінскі тэатральна-мастацкі інстытут, аддзяленне дызайну. За ўдзел ва Усесаюзным конкурсе студэнтаў мастацкіх устаноў атрымаў дыплом І ступені. З 1985 па 1992 гг. працуе мастацкім рэдактарам выдавецтва “Беларусь”. З 1992 г. пасля заканчэння аспірантуры працуе ў Беларускай акадэміі мастацтваў, з 1996 г. – выконваючы абавязкі загадчыка кафедры гісторыі і тэорыі мастацтва.',
                'З 1998 г. па сумяшчальніцтву выкладае ў Еўрапейскім гуманітарным універсітэце імя М. Танка. Кандыдат мастацтвазнаўства, дацэнт. З 1995 г. з’яўляецца членам праўлення музея сучаснага выяўленчага мастацтва ў Мінску, куратарам выставак у музеі сучаснага выяўленчага мастацтва, вольным куратарам усіх мастацкіх выставак у рэспубліцы і за яе межамі. 1995 г. – пераможца конкурсу Беларускага фонду Сораса “Вялікія гарады” на творчую паездку ў Рым. Вынік гэтай паездкі – монавыстаўка М. Баразны “Вечны горад – вечны...”. У 2001 г. выдаў кнігу “Беларуская кніжная графіка 1960-1990 гг.”, за якую ў 2002 годзе атрымаў спецыяльную прэмію прэзідэнта краіны А.Р. Лукашэнка і дыплом “За высокія дасягненні ў вобласці мастацтва”.',
                'У 2002 г. прысвоена званне акадэміка Беларускай Акадэміі выяўленчага мастацтва. Міхаіл Баразна – аўтар многіх фотапраектаў, упершыню ў нашай краіне распрацаваў камп’ютэрны дызайн. Асноўны напрамак творчасці – прамысловая графіка. Яго праекты закуплены і захоўваюцца ў фондах музеяў г.Магілёва, Мінска, Віцебска. Пастаянна супрацоўнічае з нямецкім культурным цэнтрам імя Гётэ ў Мінску: арганізоўвае сумесныя выставы, выдае мастацка-фатаграфічныя праекты, мастацкія альбомы, прапагандуе дасягненні беларускіх мастакоў. Працуе прарэктарам па навукова-творчай рабоце ў Беларускай Акадэміі мастацтваў. Жыве ў г. Мінску.'
            ],
            works: [
                'http://catalog.library.mogilev.by/kray/Znak_new/krugloe/r13p24_1.files/image003.jpg'
            ],
            youtubeVideoUrl: 'https://youtu.be/4O_1ywxjNn0',
            wikipediaUrl: '',
            birthCoords: [54.21836253489146, 29.777082501083278],
            studyCoords: [53.9229862327532, 27.601349007400657]
        },
        {
            id: 1,
            name: 'Аляксандр Аляксеевіч Аляксееў',
            photo: 'https://upload.wikimedia.org/wikipedia/commons/c/c4/Mikhail_Borozna.jpg',
            text: [
                'Нарадзіўся 14 лістапада 1978 года ў г. Казань, у сям’і вайскоўца. З 1979 года сям’я пераехала ў Беларусь. У 2000 годзе скончыў факультэт менеджменту Беларускага дзяржаўнага эканамічнага ўніверсітэта. У 2000 годзе ўзнагароджаны медалём Міністэрства адукацыі і навукі Расійскай Федэрацыі «За лепшую навуковую працу» сярод маладых вучоных па выніках адкрытага ўсерасійскага конкурсу. У 2004 годзе абараніў дысертацыю, прысуджана навуковая ступень кандыдата эканамічных навук.',
                'З 2001 года пачаў працаваць на беларускім тэлебачанні. З’яўляўся вядучым і рэжысёрам праграмы «Знята!», рэдактарам тэлевізійных праектаў «Наша спадчына», «Новая калекцыя», «Эпоха». З 2001 года акрэдытаваны ў якасці беларускага фатографа і журналіста на міжнародных кінафестывалях у Кане, Берліне і Венецыі. З 2003 года ў якасці сааўтара сумесна з Алегам Лукашэвічам рэалізуе мастацкі праект «Спадчына Беларусі» (па міжнароднаму прадстаўленні гістарычнай і культурнай спадчыны Беларусі), які ўключае выданне прэзентацыйных альбомаў, правядзенне міжнародных фотавыставак, вытворчасць дакументальных фільмаў і тэлевізійных праграм для міжнароднай аўдыторыі. У студзені 2005 года стаў Лаўрэатам Прэміі Прэзідэнта Рэспублікі Беларусь «За духоўнае адраджэнне».',
                'З 2007 года з’яўляецца беларускім выдаўцом. Сумесна з Алегам Лукашэвічам арганізаваў адкрыццё першага Нацыянальнага павільёна Рэспублікі Беларусь на 64 Канскім кінафестывалі. У маі 2011 года стаў намеснікам кіраўніка Нацыянальнага павільёна. З 2012 года працуе ў беларускай дакументалістыцы ў якасці рэжысёра. У 2014 годзе скончыў Беларускую дзяржаўную акадэмію мастацтваў па спецыяльнасці рэжысёр.'
            ],
            works: [
                'http://спадчына.бел/assets/heritage-_of_belarus_homel_04.jpg',
                'http://спадчына.бел/assets/heritage-_of_belarus_hrodna_03_big.jpg',
                'http://спадчына.бел/assets/heritage-_of_belarus_minsk_02_big.jpg'
            ],
            youtubeVideoUrl: 'https://youtu.be/usU-Sgpr4LQ',
            wikipediaUrl: '',
            birthCoords: [53.878817270700836, 27.607884584657043],
            studyCoords: [55.78816687390304, 49.112441792771094]
        },
    ]
}

const dataReducer = (state = initialState, action) => {
    switch (action.type) {
        default:
            return state
    }
}

export default dataReducer